app/controllers/comments_controller.rb

  def create
   @post = Post.find(params[:post_id])
   @comment = @post.comments.new(comment_params)
   @comment.post_id = params[:post_id]
   @comment.save!
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "content", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commenter", "Diana"], ["content", "comment 1"], ["post_id", 2], ["created_at", 2016-11-14 23:07:40 UTC], ["updated_at", 2016-11-14 23:07:40 UTC]]