app/controllers/posts_controller.rb

  def create
    @post = Post.create(post_params)
---
INSERT INTO "posts" ("name", "description", "resume", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["description", ""], ["resume", ""], ["created_at", 2016-11-11 20:39:50 UTC], ["updated_at", 2016-11-11 20:39:50 UTC]]

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "description" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["description", "Selfmade Detective. Really awesome at finding things. Please help me update my resume"], ["updated_at", 2016-11-16 16:52:44 UTC], ["id", 3]]