app/controllers/sessions_controller.rb

  def create
  input_username = params[:user][:username]   # Save the username value submitted through the form

  # If the user exists, sign them in...
  if User.exists?(username: input_username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Diana"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Diana"], ["LIMIT", 1]]