app/controllers/users_controller.rb

  def create
      @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Diana "], ["password", "blah"], ["created_at", 2016-11-17 01:31:48 UTC], ["updated_at", 2016-11-17 01:31:48 UTC]]